import numpy as np


"""
e = genpulse(f0,d,fs)

Δεδομένης της θεμελιώδους συχνότητας σε Hz, αυτή η συνάρτηση
δημιουργεί ένα σήμα από σειρά συναρτήσεων Kronecker
με απόσταση P δειγμάτων ανάμεσα στους παλμούς.
P = fs/f0, όπου [fs] είναι η συχνότητα δειγματοληψίας.
Το συνολικό σήμα θα έχει διάρκεια [d] δευτερολέπτων.

"""


def genpulse(*args, **kwargs):
    if len(args) < 3:
        fs = 8000 # προεπιλεγμένη συχνότητα δειγματοληψίας σε Hz

    Ln = int(args[1] * fs) # δείγματα

    e = np.zeros((1, Ln))[0]
    P = np.round(fs/args[0]) # περίοδος των παλμών σε δείγματα
    for i in range(0, Ln, int(P)):
        e[i] = 1

    return e

