dt = 0.01;                                % Βήμα στο χρόνο
T0 = 1;                                   % Επιλέγουμε μια περίοδο
t = 0:dt:4*T0;                            % Απεικονίζουμε 4 περιόδους
N = 40;                                   % Θέλουεμε 40 ημίτονα
X0 = 1/2;                                 % Συντελεστής X0
x = zeros(1, length(t));                  % Δέσμευση μνήμης
for k = 1:N                               % Βρόχος επανάληψης
x = x + 1/(k*pi)*cos(2*pi*k/T0*t + pi/2); % Σύνθεση σήματος
end
x = x + X0                                % Προσθήκη X0
plot(t, x); grid;                         % Γράφημα
title('Fourier Series I');                % Τίτλος
xlabel('Time (s)');                       % Ετικέτα άξονα x
